<template>
  <div class="max-w-6xl mx-auto p-4"> <!-- Контейнер с максимальной шириной и отступами -->
    <img src="https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/ITMO_University_official_logo_horizontal.png/1200px-ITMO_University_official_logo_horizontal.png?20160613134308" alt="Логотип ИТМО" />
    <h1>Добро пожаловать на главную страницу!</h1>
    <p>
      Добро пожаловать на нашу уникальную образовательную платформу, где обучение и знания доступны каждому. Здесь вы найдете широкий спектр инструментов и ресурсов, которые помогут вам достичь новых вершин в обучении и преподавании.
      <br><br>
      Преподаватели могут создавать индивидуализированные тесты, ориентированные на конкретные темы и предметы. Наша система позволяет легко составлять тесты с различными типами вопросов, включая выбор ответа из нескольких вариантов, короткие ответы и многое другое. Это идеальный инструмент для оценки знаний и отслеживания прогресса студентов в учебном процессе.
      <br><br>
      Студентам предоставляется возможность доступа к тестам и прохождения их в удобное время. Они могут проверить свои знания и получить мгновенную обратную связь по результатам теста. Также студенты могут оставлять свои комментарии и отзывы о тестах, что делает процесс обучения более интерактивным и вовлекающим.
      <br><br>
      На платформе также доступна продвинутая система аналитики, которая позволяет преподавателям просматривать и анализировать результаты тестов всех студентов. Это полезный инструмент для улучшения методик преподавания и оптимизации учебных программ.
      <br><br>
      Мы стремимся сделать процесс обучения максимально удобным и эффективным, поэтому наш сайт адаптирован для использования на мобильных устройствах. Теперь обучение доступно в любое время и в любом месте.
      <br><br>
      Присоединяйтесь к нашей образовательной платформе сегодня и откройте для себя новый мир знаний и возможностей!
    </p>
    <!-- Ссылки -->
    <a v-if="!isAuthenticated" href="/auth" class="bg-blue-500 hover:bg-blue-700 text-white font-bold py-2 px-4 rounded focus:outline-none focus:shadow-outline">
      Войдите
    </a>
    <a v-else href="/tests-list" class="bg-blue-500 hover:bg-blue-700 text-white font-bold py-2 px-4 rounded focus:outline-none focus:shadow-outline">
      Список тестов
    </a>
  </div>
</template>

<script>
export default {
  name: 'Home',
  data() {
    return {
      user: null, // Здесь мы храним информацию о пользователе
    };
  },
  computed: {
    isAuthenticated() {
      return !!this.user;
    }
  },
  created() {
    this.user = JSON.parse(localStorage.getItem('currentUser'));
  }
};
</script>

<style scoped>
/* Вы можете добавить общие стили здесь, если это необходимо, например: */
</style>
